[
    {
        "id": "summer-scholarship-content",
        "title": "CREST Summer Scholarships",
        "subtitle": "2021-2022",
        "subtitle2": "Jointly held with <a href='https://www.dl-cti.org/'>the DL-CTI Workshop</a>",
        "text": "December 7, 2021",
        "link": "/index-processing",
        "bg_image": "./images/hero/happy-study.jpeg"
    },
    {
        "id": "summer-scholarship-project1",
        "title": "Human security dashboard",
        "projectdetail": "The exponential growth of technological advancements has led to significant growth of security threats and risks. No matter how small they are, businesses now need to be aware of and consciously apply security measures at every level. Despite the many countermeasures, technologies, and solutions to mitigate security breaches and related threats, successful security attacks are still on the rise. Technology alone cannot be considered a comprehensive solution to all sophisticated organisational security threats; the people in the organisations are actually the primary and the weakest line of defence. <br /> This project aims to design a human security dashboard using the existing Cyber Common Operating Picture (CCOP) platform and infrastructure. This human security dashboard will visualise various metrics covering various aspects of human security, including phishing and security training and engagement. The human security dashboard will allow organisations to keep a close eye on how the security risk of an organisation changes due to employees in the organisation and take proactive countermeasures swiftly.",
        "supervisor": "Asangi Jayatilaka and Ali Babar",
        "student": "Minhaj Ahmed",
        "twitterid": "1467705139398004737",
        "studentemail": "minhaj.ahmed@student.adelaide.edu.au",
        "studentphoto": "./images/hero/student1.png",
        "studentprofile": "Minhaj Ahmed is a second year Bachelor of Computer Science (Advanced) student at The University of Adelaide. Minhaj has received a scholarship on his admission at The University of Adelaide based on academic merit. His fascination towards research has propelled Minhaj to get involved in project works, and he is working on a project which aims at designing a human security dashboard which would visualise various metrics covering various aspects of human security, including phishing, security training and engagement. The research is being supervised by Dr Asangi Jayatilaka and Professor Ali Babar. Minhaj is excited to leverage on the opportunity to explore new techniques and use this learning experience as a driving force for his future career."
    },
    {
        "id": "summer-scholarship-project2",
        "title": "An Empirical Analysis of Pre- and Post-Release Vulnerabilitie",
        "projectdetail": "Vulnerability mitigation can occur at many stages of the Software Development Lifecycle (SDL). Importantly, there are two main categories of vulnerabilities based on the stage at which they are detected: pre-release vulnerabilities that are identified internally during testing and development, and post-release vulnerabilities that escaped the testing phase and have been identified in deployed products. There is an important distinction between these two categories, as post-release vulnerabilities are exposed to the user and potential malicious actors, resulting in potential security impacts and devastating consequences. Hence, ideally all vulnerabilities should be identified pre-release. <br /> This naturally poses the question as to why these vulnerabilities have been detected at different stages of the SDL; why do some vulnerabilities escape the testing phase whereas others do not. If the characteristics of these vulnerabilities differ, it is also imperative that we garner an understanding of the consequences on software testing and debugging, so that we can develop better detection methods and more targeted code analysis techniques. <br /> In this project, we will use quantitative and regression analysis to derive insights into different categories of vulnerabilities. Furthermore, we will investigate how differences in these vulnerabilities can impact downstream tasks, such as predictive modelling.",
        "supervisor": "Roland Croft and Ali Babar",
        "student": "Pitawelayalage Dasun Pitawela",
        "twitterid": "1468034872916647936",
        "studentemail": "pitawelayalagedasun.pitawela@student.adelaide.edu.au",
        "studentphoto": "./images/hero/student2.png",
        "studentprofile": "I am Dileepa, a student reading for Master of Data Science. I completed my BSc. (Hons). at the University of Moratuwa, Sri Lanka and worked for about 2.5 years as a Software Engineer in the industry. It is a great pleasure to announce that I’ve been awarded the CREST summer research scholarship for the second consecutive year. During this program, I get to work in a cyber security related research project that has an industry level impact. It indeed helps me to level up my software engineering skills as well as research skills. Apart from academics, I volunteer as an International Peer Mentor in International Student Support, as a Volunteer Ambassador in the faculty of ECMS and as an active member in the University of Adelaide chapter of Golden Key international student honour society which recognises top 15% students of the university."
    },
    {
        "id": "summer-scholarship-project3",
        "title": "Evaluation of Benchmarking Dataset for Data Exfiltration",
        "projectdetail": "Data exfiltration is the process of retrieving, copying, and/or transferring data without authorization. According to Verizon Breach Report, a total of 157,525 data exfiltration/breach incidents have been reported in 2020. In order to detect, prevent, and investigate data exfiltration, several data exfiltration countermeasures have been recently proposed. However, evaluating these countermeasures is a challenge. This is because of the unavailability of a benchmark dataset to rigorously evaluate these countermeasures with respect to various metrics such as accuracy, response time, and scalability. Previously, we have created a benchmarking dataset for data exfiltration. <br /> In this work, we aim to evaluate how good/bad is the dataset. We plan to evaluate the dataset to answer the following questions – (i) Whether or not the testbed used for generating the dataset represents a real-world scenario? (ii) How accurately ML/DL approaches classify the instances in the dataset intro respective classes? (iii) Whether or not the datasets is labelled correctly and in a reliable manner? (iv) Whether or not the data is captured in its entirety? (v) Is the dataset skewed significantly towards one particular class (e.g., benign)? (vi) Whether or not sharing the dataset publicly violates any privacy or ethical concerns?",
        "supervisor": "Faheem Ullah and Ali Babar",
        "student": "Mythri Ramadas Kadaba",
        "twitterid": "1469193775658405888",
        "studentemail": "a1838774@student.adelaide.edu.au",
        "studentphoto": "./images/hero/student3.png",
        "studentprofile": "I am Mythri Ramadas Kadaba, a Masters of Datascience student at the University of Adelaide. I have completed my Bachelor in engineering from Bangalore, India. I have worked for over 5 years in database administration and data mining support projects in India and UK. I enjoy working with data and making sense of it, while using machine learning techniques to enrich the information extraction."
    },
    {
        "id": "summer-scholarship-project4",
        "title": "Metadata augmentation of Combat System Maps",
        "projectdetail": "Combat Management Systems are used to empower naval platforms throughout the world in the execution of their missions. An important feature of a Combat Management System is the ability to visualize a situation and the environment in which it occurs. A 'Map Server' provides reference information to components, such as user interfaces, that support building a cohesive and consistent picture of the evolving situation for all consumers of the information. <br /> This project aims to build a Map Server of tomorrow that will provide an enhanced map to the end-users. The Map Server will be built by combining the rich contextual data, providing both a graphical picture of what things are at a location, together with more descriptive data that give a richer picture of each entity's capabilities and characteristics. <br /> The expected outcome of this project is a metadata-enabled Combat Management Systems 'Map Server' that incorporates the Graphical Information System (GIS). The developed Map Server should provide a deeper level of details about locations or areas, which will be used to conduct a range of analyses and experiments. The effectiveness of the Map Server will be evaluated in manipulating and visualizing the information of the Map Server over traditional maps (augmented with reference information metadata concepts).",
        "supervisor": "Ali Babar, Aufeef Chauhan and Tim Priest",
        "student": "Ruixuan Zou",
        "twitterid": "1470545839449726978",
        "studentemail": "ruixuan.zou@student.adelaide.edu.au",
        "studentphoto": "./images/hero/student4.png",
        "studentprofile": "I am a current MSc Data Science student at the University of Adelaide, currently in the second year of my MSc career. My work background is in data analysis in business investment, and my main research interests at university are in computer vision and pattern recognition, with a focus on unsupervised machine learning directions."
    },
    {
        "id": "summer-scholarship-project5",
        "title": "Distributed Decision Making in a Crisis: How can AI help the Emergency Services",
        "projectdetail": "Emergency services in Australia include Police, Fire (both metropolitan and country), Coast Guard, Surf Lifesaving, Paramedics, State Emergency Service and more. These services regularly work together as heterogeneous teams to address many complex situations, utilising a wide range of capabilities and technologies across a diverse range of environments and scenarios. The individual doctrine, training, policies and governance of these services impacts the way in which the services work together and how communication is handled for human-human teams, human-machine teams and, increasingly, machine-machine teams. <br /> In responding to any emergency (and potentially life-threatening situation) decisions on how to respond are made quickly and with information that ranges in content and quality; leading to potential uncertainty, ambiguity and delay in response. The varying platform capabilities, roles and operator skill levels across heterogeneous information systems of the emergency services add to the response-complexity problem and ability to optimise response planning. The underlying technologies to support emergency service operations must therefore be robust, resilient and adaptive to allow the 'who, what, where and when' for agile response planning across the heterogeneous capability environment. <br /> This project, hosted by the Human and Autonomous Decision Systems group at DST, will investigate methods and technologies that could be employed and harnessed to produce solutions to issues such as optimised distributed decision making faced by emergency services and other domains. We are open to solutions, but this project could involve the use of Artificial Intelligence (AI), Machine-Learning (ML), micro-service architectures and self-aware systems or a combination of innovative techniques. Whatever the solution, your goal is to optimise the application of emergency service capabilities in response to critical situations.",
        "supervisor": "Ali Babar, Aufeef Chauhan and Tim Priest",
        "student": "Yankun Chen",
        "twitterid": "1470545839449726978",
        "studentemail": "a1763007@student.adelaide.edu.au",
        "studentphoto": "./images/hero/student5.png",
        "studentprofile": "I am Yankun Chen, studying for a double-degree: Bachelor of Mathematics and Computer Science with Bachelor of Finance. This is my fourth year of study, and I will graduate in June 2022. Before starting to study my bachelor in University of Adelaide, I had worked for several years in three companies in China and in Singapore. I was awarded Master and Bachelor degrees in Electrical engineering in Beijing Jiaotong University."
    },
    {
        "id": "processing-hero-content",
        "title": "Data Mining and Machine Learning for <span>Cybersecurity</span> Workshop",
        "subtitle": "ICDM 2021",
        "subtitle2": "Jointly held with <a href='https://www.dl-cti.org/'>the DL-CTI Workshop</a>",
        "text": "December 7, 2021",
        "link": "/index-processing",
        "bg_image": "./images/hero/slider-processing-slide-01-bg.jpeg"
    },
    {
        "id": "icdm-workshop",
        "title": "Workshop",
        "subtitle": "Data Mining and Machine Learning for Cybersecurity (DMC) workshop will be held in conjunction with The 2021 IEEE International Conference on Data Mining (ICDM2021, <a href='https://icdm2021.auckland.ac.nz/'>https://icdm2021.auckland.ac.nz/</a>) on December 7-10, 2021.",
        "subtitle2": "<b>DMC is jointly held with the DL-CTI workshop</b> (<a href='https://www.dl-cti.org/'>https://www.dl-cti.org/</a>). DMC workshop is a full-day event that includes three speakers. The workshop will be held on December 7, 2021."
    },
    {
        "id": "icdm-scope",
        "title": "Scope",
        "subtitle": "In the past decades, cybersecurity threats have been among the greatest challenges for social development resulting in financial loss, violation of privacy, damages to infrastructures, etc. Organizations, governments, and cyber practitioners tend to leverage state-of-the-art Artificial Intelligence technologies to analyse, prevent, and protect their data and services against cyber threats and attacks. Due to the complexity and heterogeneity of security systems, cybersecurity researchers and practitioners have shown increasing interest in applying data mining methods to mitigate cyber risks in a wide range of security areas, such as malware detection and key player identification in an underground forum. To protect the cyber world, we need more effective and efficient algorithms and tools that are capable of automatically and intelligently analysing and classifying the massive amount of data in cybersecurity complex scenarios. This workshop will focus on empirical findings, methodological papers, and theoretical and conceptual insights related to data mining in the field of cybersecurity."
    },
    {
        "id": "icdm-topics",
        "title": "Topics",
        "subtitle": "The workshop aims to bring together researchers from cybersecurity, data mining, and machine learning domains. We encourage a lively exchange of ideas and perceptions through the workshop, focused on cybersecurity and data mining. Topics of interest include, but are not limited to:",
        "item1": "1. Data mining and AI applications for cybersecurity",
        "item2": "2. Data-driven cybersecurity innovation",
        "item3": "3. Modelling and simulation of cyber systems and system components",
        "item4": "4. Data mining approaches to make cyber systems secure and resilient",
        "item5": "5. Human behaviour models with application to cybersecurity",
        "item6": "6. AI tools and techniques, mental resilience, and cybersecurity",
        "item7": "7. Data mining for cybersecurity software verification and validation",
        "item8": "8. Automation of heterogeneous security tools",
        "item9": "9. Decision making with uncertainty in cyber systems",
        "item10": "10. Security and privacy",
        "ps": "We are interested in the new applications of data mining and AI for cybersecurity. Submitted papers will be evaluated based on criteria such as technical originality, creativity, and applicability.",
        "new1": "Methodological topics of interest include, but are not limited to:",
        "new2": "Application areas of interest include, but are not limited to:",
        "content1": "1. Graph convolution networks and graph attention networks <br />2. Interpretable deep learning<br />3. Real-time and/or streaming deep learning<br />4. Multi-view deep learning paradigms<br />5. Deep adversarial learning (e.g., generative adversarial networks)<br />6. Deep transfer learning<br />7. Deep Bayesian learning<br />8. Deep reinforcement learning<br />",
        "content2": "1. Malware evasion and detection<br />2. IP reputation services<br />3. Event correlation and anomaly detection<br />4. Internet of Things (IoT) analysis (e.g., fingerprinting, network telescopes, etc.)<br />5. Threat modeling (e.g., mapping exploits to MITRE ATT&CK)<br />6. Security data fusion (e.g., event correlation) across multiple data sources<br />7. Cybersecurity information sharing and automation<br />8. Smart and large-scale vulnerability assessment and management systems<br />9. Security Intelligence Augmentation (e.g., human-in-the-loop systems)<br />10. Dark Web Analytics for CTI applications"
    },
    {
        "id": "icdm-speaker",
        "title": "Guest Speakers",
        "item1": "Giovanni Russello, The University of Auckland, New Zealand",
        "item2": "Ryan Ko, The University of Queensland, Australia",
        "item3": "Xuyun Zhang, Macquarie University, Australia"
    },
    {
        "id": "icdm-submission",
        "title": "Submission & Publication",
        "link": "https://www.ieee.org/conferences/publishing/templates.html",
        "item1": "Paper submissions should be limited to max 8 pages plus 2 extra pages and follow the IEEE ICDM format. More detailed information is available in the IEEE ICDM 2021 Submission Guidelines ",
        "item2": "<a href='https://wi-lab.com/cyberchair/2021/icdm21/scripts/submit.php?subarea=S15&undisplay_detail=1&wh=/cyberchair/2021/icdm21/scripts/ws_submit.php'>Please submit your manuscript through the DMC 2021 submission site.</a>",
        "item3": "All accepted workshop papers will be published in the dedicated ICDMW proceedings published by the IEEE Computer Society Press. Therefore, papers must not have been accepted for publication elsewhere or be under review for another workshop, conferences, or journals.",
        "ps": "We are interested in the new applications of data mining and AI for cybersecurity. Submitted papers will be evaluated based on criteria such as technical originality, creativity, and applicability."
    },
    {
        "id": "icdm-important",
        "title": "Important Date",
        "item1": "Submissions due: September 3, 2021",
        "item2": "Notifications of Acceptance: September 24, 2021",
        "item3": "Camera-ready paper due: October 1, 2021",
        "item4": "Workshop day: December 7, 2021",
        "item5": "All dates are 11:59PM Pacific Daylight Time (PDT).",
        "ps": "We are interested in the new applications of data mining and AI for cybersecurity. Submitted papers will be evaluated based on criteria such as technical originality, creativity, and applicability."
    },
    {
        "id": "icdm-organisation",
        "title": "Workshop Organisation",
        "subtitle": "Workshop Organiser",
        "subtitle2": "Program Committee",
        "item1": "Muhammad Ali Babar, The University of Adelaide, Australia",
        "item31": "Hsinchun Chen, University of Arizona",
        "item32": "Sagar Samtani, Indiana University",
        "item33": "Victor Benjamin, Arizona State University",
        "item34": "Weifeng Li, University of Georgia",
        "item2": "Gillian Dobbie, The University of Auckland, New Zealand",
        "item21": "Ankit Shah, University of South Florida",
        "item22": "Hongyi Zhu, University of Texas, San Antonio",
        "item23": "Nasir Ghani, University of South Florida",
        "item24": "Hyrum Anderson, Microsoft",
        "item3": "Zahid Islam, Charles Sturt University, Australia",
        "item4": "Reza Shahamiri, The University of Auckland, New Zealand",
        "item5": "Ranran Bian, The University of Adelaide, Australia",
        "item51": "Ethan Rudd, FireEye",
        "item52": "Balaji Padmanabhan, University of South Florida",
        "item53": "Elias Bou-Harb, University of Texas, San Antonio",
        "item54": "Yunji Liang, Northwestern Polytechnical University",
        "item55": "Yidong Chai, Tsinghua University",
        "item56": "Shuo Yu, Texas Tech University",
        "item57": "Reza Ebrahimi, University of Arizona",
        "item6": "Muhammad Ali Babar, The University of Adelaide, Australia",
        "item7": "Gillian Dobbie, The University of Auckland, New Zealand",
        "item8": "Zahid Islam, Charles Sturt University, Australia",
        "item9": "Reza Shahamiri, The University of Auckland, New Zealand",
        "item10": "Ranran Bian, The University of Adelaide, Australia",
        "item11": "Michael Bewong, Charles Sturt University, Australia",
        "item12": "Rafiqul Islam, Charles Sturt University, Australia",
        "ps": "We are interested in the new applications of data mining and AI for cybersecurity. Submitted papers will be evaluated based on criteria such as technical originality, creativity, and applicability."
    },
    {
        "id": "icdm-contact",
        "title": "Contact Us",
        "subtitle": "Muhammad Ali Babar",
        "subtitle2": "Ranran Bian",
        "item1": "School of Computer Science, Faculty of Engineering, Computer and Mathematical Sciences, The University of Adelaide",
        "item2": "Floor/Room 4 54, Ingkarni Wardli, North Terrace, Adelaide 5000, Australia",
        "item3": "ali.babar@adelaide.edu.au",
        "item4": "School of Computer Science, Faculty of Engineering, Computer and Mathematical Sciences, The University of Adelaide",
        "item5": "Floor/Room 5 48D, Ingkarni Wardli, North Terrace, Adelaide 5000, Australia",
        "item6": "monica.bian@adelaide.edu.au",
        "item7": "Gillian Dobbie, The University of Auckland, New Zealand",
        "item8": "Zahid Islam, Charles Sturt University, Australia",
        "item9": "Reza Shahamiri, The University of Auckland, New Zealand",
        "item10": "Ranran Bian, The University of Adelaide, Australia",
        "item11": "Michael Bewong, Charles Sturt University, Australia",
        "item12": "Rafiqul Islam, Charles Sturt University, Australia",
        "ps": "We are interested in the new applications of data mining and AI for cybersecurity. Submitted papers will be evaluated based on criteria such as technical originality, creativity, and applicability."
    }
]